//ARCHUTIU PROC SOUT='*',
//         ARCHOUT=NULLFILE,
//         SEQFL=
//*
//*   COPY A SEQUENTIAL FILE RECEIVED BY NJE38 OR RECV370 THAT
//*   WAS WRITTEN BY PROC ARCHUTIL.
//*
//*   NOTE - THE ARCHIVE MUST BE CREATED WITH IDCAMS.
//*
//STEP1   EXEC PGM=ARCHUTIL,PARM='UNLOAD',REGION=4096K
//SYSPRINT DD SYSOUT=&SOUT
//ARCHOUT  DD DSN=&ARCHOUT,DISP=SHR
//SEQFL    DD DSN=&SEQFL,DISP=SHR
