//ARCHUTIL PROC SOUT='*',
//         ARCHIN=NULLFILE,
//         SEQFL=,
//         SEQVOL=
//*
//*    COPY AN ARCHIVE TO A SEQUENTIAL DATASET SUITABLE FOR
//*    TRANSMISSION USING NJE38 OR XMIT370.
//*
//STEP1  EXEC PGM=ARCHUTIL,PARM='LOAD',REGION=4096K
//SYSPRINT DD SYSOUT=&SOUT
//ARCHIN   DD DSN=&ARCHIN,DISP=SHR
//SEQFL    DD DSN=&SEQFL,DISP=(NEW,CATLG,DELETE),
//            UNIT=SYSDA,VOL=SER=&SEQVOL,SPACE=(CYL,(20,20),RLSE),
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=3120)
