//A0611AR  JOB 01,ARCHIVER,CLASS=A,MSGLEVEL=(1,1),
//         MSGCLASS=X,TIME=30,NOTIFY=&SYSUID,REGION=2M
//*
//*     PDSDOC *INSTALL ARCHIVER VERSION 6 ON MVS3.8J................*
//*
//ARCHASM  PROC  M=
//ASM      EXEC  PGM=IFOX00,
//         PARM='TERM,DECK,NOOBJ,NORLD,XREF(SHORT)'
//SYSPRINT DD  SYSOUT=*
//SYSTERM  DD  SYSOUT=*
//SYSLIB   DD  DSN=&&MACLIB,DISP=(OLD,PASS)
//         DD  DSN=A0611.ARCHIVER.ASM,DISP=SHR
//         DD  DSN=SYS1.AMODGEN,DISP=SHR
//         DD  DSN=SYS1.MACLIB,DISP=SHR
//SYSUT1   DD  UNIT=SYSALLDA,SPACE=(CYL,(3,1))
//SYSUT2   DD  UNIT=SYSALLDA,SPACE=(CYL,(3,1))
//SYSUT3   DD  UNIT=SYSALLDA,SPACE=(CYL,(3,1))
//SYSIN    DD  DSN=A0611.ARCHIVER.ASM(&M),DISP=SHR
//SYSPUNCH DD  DSN=A0611.ARCHIVER.OBJ(&M),DISP=SHR
//         PEND
//*
//STEP01  EXEC PGM=IEBUPDTE,PARM=NEW
//SYSPRINT DD  SYSOUT=*
//SYSUT2   DD  DSN=&&MACLIB,UNIT=3390,SPACE=(800,(3,2,2)),
//             DISP=(NEW,PASS),DCB=(RECFM=FB,LRECL=80,BLKSIZE=27920)
//SYSIN    DD  *
./ ADD NAME=AMODE
         MACRO
&NAME    AMODE
         MEND
./ ADD NAME=RMODE
         MACRO
&NAME    RMODE
         MEND
./ ENDUP
/*
//*
//STEP02  EXEC PGM=IDCAMS
//SYSPRINT DD  SYSOUT=*
//SYSIN    DD  *
 DELETE A0611.ARCHIVER.OBJ PURGE
 DELETE A0611.ARCHIVER.LOAD PURGE
 SET LASTCC=0
 SET MAXCC=0
/*
//*
//STEP03  EXEC PGM=IEFBR14
//OBJ      DD  DISP=(NEW,CATLG),UNIT=SYSALLDA,
//             SPACE=(TRK,(30,5,10)),VOL=SER=ROB999,
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=3200),
//             DSN=A0611.ARCHIVER.OBJ
//LOAD     DD  DISP=(NEW,CATLG),UNIT=SYSALLDA,
//             SPACE=(TRK,(30,5,10)),VOL=SER=ROB999,
//             DCB=(RECFM=U,BLKSIZE=6144),
//             DSN=A0611.ARCHIVER.LOAD
//*
//AMATRACE EXEC  ARCHASM,M=AMATRACE
//ARCHALIS EXEC  ARCHASM,M=ARCHALIS
//ARCHALT  EXEC  ARCHASM,M=ARCHALT
//ARCHCOMP EXEC  ARCHASM,M=ARCHCOMP
//ARCHCONV EXEC  ARCHASM,M=ARCHCONV
//ARCHCOPY EXEC  ARCHASM,M=ARCHCOPY
//ARCHDEL  EXEC  ARCHASM,M=ARCHDEL
//ARCHDELC EXEC  ARCHASM,M=ARCHDELC
//ARCHDELD EXEC  ARCHASM,M=ARCHDELD
//ARCHDELE EXEC  ARCHASM,M=ARCHDELE
//ARCHDELF EXEC  ARCHASM,M=ARCHDELF
//ARCHDEL1 EXEC  ARCHASM,M=ARCHDEL1
//ARCHDEL2 EXEC  ARCHASM,M=ARCHDEL2
//ARCHDEL3 EXEC  ARCHASM,M=ARCHDEL3
//ARCHDEL4 EXEC  ARCHASM,M=ARCHDEL4
//ARCHDEL5 EXEC  ARCHASM,M=ARCHDEL5
//ARCHDEL6 EXEC  ARCHASM,M=ARCHDEL6
//ARCHDEL7 EXEC  ARCHASM,M=ARCHDEL7
//ARCHDIR  EXEC  ARCHASM,M=ARCHDIR
//ARCHERAS EXEC  ARCHASM,M=ARCHERAS
//ARCHERRM EXEC  ARCHASM,M=ARCHERRM
//ARCHEXPR EXEC  ARCHASM,M=ARCHEXPR
//ARCHFORM EXEC  ARCHASM,M=ARCHFORM
//ARCHIMPR EXEC  ARCHASM,M=ARCHIMPR
//ARCHINIT EXEC  ARCHASM,M=A370INIT
//ARCHKDCB EXEC  ARCHASM,M=ARCHKDCB
//ARCHKNAM EXEC  ARCHASM,M=ARCHKNAM
//ARCHLDT  EXEC  ARCHASM,M=ARCHLDT
//ARCHLFTP EXEC  ARCHASM,M=ARCHLFTP
//ARCHLFVS EXEC  ARCHASM,M=ARCHLFVS
//ARCHLIST EXEC  ARCHASM,M=ARCHLIST
//ARCHLOAD EXEC  ARCHASM,M=ARCHLOAD
//ARCHLSTT EXEC  ARCHASM,M=ARCHLSTT
//ARCHMAIN EXEC  ARCHASM,M=ARCHMAIN
//ARCHMSGS EXEC  ARCHASM,M=ARCHMSGS
//ARCHNOTE EXEC  ARCHASM,M=ARCHNOTE
//ARCHPARS EXEC  ARCHASM,M=ARCHPARS
//ARCHPRSC EXEC  ARCHASM,M=ARCHPRSC
//ARCHRSPC EXEC  ARCHASM,M=ARCHRSPC
//ARCHTABS EXEC  ARCHASM,M=ARCHTABS
//ARCHUNLD EXEC  ARCHASM,M=ARCHUNLD
//ARCHVSOP EXEC  ARCHASM,M=ARCHVSOP
//CELLMAN  EXEC  ARCHASM,M=CELLMAN
//COMPACT  EXEC  ARCHASM,M=COMPACT
//DYNAM    EXEC  ARCHASM,M=DYNAM
//EXPAND   EXEC  ARCHASM,M=EXPAND
//EXPLODE  EXEC  ARCHASM,M=EXPLODE
//RPARSE   EXEC  ARCHASM,M=RPARSE
//LINK1    EXEC  PGM=IEWL,PARM='LIST,LET,XREF,RENT,REUS,REFR,MAP'
//SYSPRINT DD    SYSOUT=*
//SYSUT1   DD    UNIT=SYSALLDA,SPACE=(CYL,(3,1))
//SYSLIB   DD    DSN=A0611.ARCHIVER.OBJ,DISP=SHR
//SYSLMOD  DD    DSN=A0611.ARCHIVER.LOAD,DISP=SHR
//SYSLIN   DD    *
 INCLUDE SYSLIB(ARCHMAIN)
 INCLUDE SYSLIB(ARCHTABS)
 ENTRY ARCHMAIN
 NAME ARCHIVER(R)
//LINK2    EXEC  PGM=IEWL,PARM='LIST,LET,XREF,MAP'
//SYSPRINT DD    SYSOUT=*
//SYSUT1   DD    UNIT=SYSALLDA,SPACE=(CYL,(3,1))
//SYSLIB   DD    DSN=A0611.ARCHIVER.OBJ,DISP=SHR
//SYSLMOD  DD    DSN=A0611.ARCHIVER.LOAD,DISP=SHR
//SYSLIN   DD    *
 INCLUDE SYSLIB(A370INIT)
 INCLUDE SYSLIB(ARCHPRSC)
 ENTRY ARCHINIT
 NAME ARCHINIT(R)
 INCLUDE SYSLIB(ARCHPARS)
 ENTRY ARCHPARS
 NAME ARCHPARS(R)
/*
//
