//EXTNTRAN JOB 'ME',MSGCLASS=X,MSGLEVEL=(1,1),CLASS=A,NOTIFY=&SYSUID,
//        USER=HERC01,PASSWORD=CUL8TR
//*
//S1 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
 DELETE 'HERC01.ARCHEXTN.PDSXMI' NONVSAM PURGE
 DELETE 'HERC01.ARCHEXTN.XMI'    NONVSAM PURGE
 SET LASTCC=0
 SET MAXCC=0
//*
//S2   EXEC PGM=IEFBR14
//DD1      DD DSN=HERC01.ARCHEXTN.PDSXMI,DISP=(NEW,CATLG,DELETE),
//            UNIT=SYSDA,SPACE=(CYL,(3,1,10)),
//            DCB=(DSORG=PO,RECFM=FB,LRECL=80,BLKSIZE=3120)
//DD2      DD DSN=HERC01.ARCHEXTN.XMI,DISP=(NEW,CATLG,DELETE),
//            UNIT=SYSDA,SPACE=(CYL,(3,1)),
//            DCB=(DSORG=PS,RECFM=FB,LRECL=80,BLKSIZE=3120)
//*
//IKJACCNT EXEC PGM=IKJEFT01,PARM=ISPLOGON,REGION=4096K
//*SYSHELP  DD  DISP=SHR,DSN=SYS1.HELP
//*SYSPROC  DD  DISP=SHR,DSN=SYS1.CMDPROC
//SYSTSPRT DD SYSOUT=*
//SYSTSIN  DD *
 PROFILE PREFIX(HERC01)
 TRANSMIT DATASET(ARCHEXTN.ASM)     OUTDATASET(ARCHEXTN.PDSXMI(ASM))
 TRANSMIT DATASET(ARCHEXTN.COB)     OUTDATASET(ARCHEXTN.PDSXMI(COB))
 TRANSMIT DATASET(ARCHEXTN.INCLLIB) OUTDATASET(ARCHEXTN.PDSXMI(INCLLIB))
 TRANSMIT DATASET(ARCHEXTN.JCL)     OUTDATASET(ARCHEXTN.PDSXMI(JCL))
 TRANSMIT DATASET(ARCHEXTN.LISTING) OUTDATASET(ARCHEXTN.PDSXMI(LISTING))
 TRANSMIT DATASET(ARCHEXTN.LOADLIB) OUTDATASET(ARCHEXTN.PDSXMI(LOADLIB))
 TRANSMIT DATASET(ARCHEXTN.MACLIB)  OUTDATASET(ARCHEXTN.PDSXMI(MACLIB))
 TRANSMIT DATASET(ARCHEXTN.NCALIB)  OUTDATASET(ARCHEXTN.PDSXMI(NCALIB))
 TRANSMIT DATASET(ARCHEXTN.PLI)     OUTDATASET(ARCHEXTN.PDSXMI(PLI))
 TRANSMIT DATASET(ARCHEXTN.PROCLIB) OUTDATASET(ARCHEXTN.PDSXMI(PROCLIB))
 TRANSMIT DATASET(ARCHEXTN.PDSXMI)  OUTDATASET(ARCHEXTN.XMI)
//
